mister_cocktail_solution/app/views/ingredients/show.html.erb

SELECT "cocktails".* FROM "cocktails" INNER JOIN "doses" ON "cocktails"."id" = "doses"."cocktail_id" WHERE "doses"."ingredient_id" = $1  [["ingredient_id", 11]]
---
<ul>
  <% @ingredient.cocktails.each do |cocktail| %>