app/views/cocktails/show.html.erb

SELECT "doses".* FROM "doses" WHERE "doses"."cocktail_id" = $1  [["cocktail_id", 1]]
---
      <ul class="list-unstyled">
        <% @cocktail.doses.each do |d| %>