mister_cocktail_solution/app/controllers/cocktails_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT 1  [["id", 2]]
SELECT "ingredients".* FROM "ingredients"
---
  def show
    @cocktail = Cocktail.find(params[:id])
    @dose = Dose.new
    @ingredients = Ingredient.all