mister_cocktail_solution/app/controllers/doses_controller.rb

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "doses" ("description", "ingredient_id", "cocktail_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "lots of"], ["ingredient_id", 7], ["cocktail_id", 1], ["created_at", "2016-05-12 16:12:51.571139"], ["updated_at", "2016-05-12 16:12:51.571139"]]
SELECT "ingredients".* FROM "ingredients"
---
  def create
    @dose = Dose.new(dose_params)
    @cocktail = Cocktail.find(params[:cocktail_id])
    @dose.cocktail = @cocktail
    if @dose.save
      redirect_to cocktail_path(@cocktail)
    else
      @ingredients = Ingredient.all

SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 2]]
---
  def destroy
    @dose = Dose.find(params[:id])
    @cocktail = @dose.cocktail
    @dose.destroy